#include <iostream>
#include <Windows.h>

double Drinks[4][4]{ { 600, 350, 510, 498 }, { 598, 198, 300 }, { 798, 698 }, { 400 } };
double ShopCart[4][4]{};

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	srand(time(NULL));

	int choose = 0, amount = 0;
	double sum = 0;

	while (true)
	{
		system("cls");
		std::cout << "\n\n\n\t\tМагазин \"Соки Александра\"\n\n\n";
		std::cout << "1 - Купить\n";
		std::cout << "2 - Посмотреть ассортимент\n";
		std::cout << "3 - Выйти\n";
		std::cin >> choose;
		if (choose == 1)
		{
			int choose2 = 0;
			system("cls");
			std::cout << "Что вы хотите купить?\n";
			std::cout << "Фруктовые соки:\n1 - Апельсиновый (600руб за 1л)\n2 - Яблочный (350руб за 1л)\n3 - Абрикосовый (510руб за 1л)\n4 - Грушевый (498руб за 1л)\n\n";
			std::cout << "Овощные соки:\n5 - Томатный (598руб за 1л)\n6 - Луковый (198руб за 1л)\n7 - Огуречный (300руб за 1л)\n\n";
			std::cout << "Чаи:\n8 - Чесночный (798руб за 1л)\n9 - Петрушевый (698руб за 1л)\n\n";
			std::cout << "Настойки:\n10 - Боярышник (400 рублей за 1л)\n\n";
			std::cin >> choose2;


			if (choose2 == 1)
			{
				system("cls");
				std::cout << "Сколько литров вы хотите взять? ";
				std::cin >> amount; 
				std::cout << ShopCart[0][0] + amount;
				Sleep(1000);
			}
		}

		//ПОДСЧЁТЫ ПОКУПОК КОРЗИНЫ, ПОТОМ ЗАСУНУТЬ В НУЖНУЮ ЧАСТЬ КОДА
		for (int i = 0; i < 4; i++)
		{
			for (int j = 0; j < 4; j++)
			{
				sum += ShopCart[i][j] * Drinks[i][j];
			}
		}

		else if (choose == 2)
		{
			int choose1 = 0;
			std::cout << "Наши соки из натуральных продуктов и являются лучшими во всём мире!\n";
			std::cout << "Фруктовые соки:\nАпельсиновый (300руб за 500мл)\nЯблочный (175руб за 500мл)\nАбрикосовый (255руб за 500мл)\nГрушевый (249руб за 500мл)\n\n";
			std::cout << "Овощные соки:\nТоматный (299руб за 500мл)\nЛуковый (99руб за 500мл)\nОгуречный (150руб за 500мл)\n\n";
			std::cout << "Так же в нашем ассортименте чаи из натуральных трав (прямиком из Китая)\n";
			std::cout << "Чаи:\nЧесночный (399руб за 500мл)\nПетрушевый (349руб за 500мл)\n\n";
			std::cout << "Настойки:\nБоярышник (200 рублей за 500мл)\n\n";
			Sleep(6000);
			std::cout << "Заинтересовал ли вас наш ассортимент?\n1 - Да, я готов купить\n2 - Как нибудь в следующий раз\n";
			std::cin >> choose1;
			if (choose1 == 1)
			{
				std::cout << "\nPLACEHOLDER, здесь будет покупка\n";
				std::cout << "\nPLACEHOLDER, здесь будет покупка\n";
				std::cout << "\nPLACEHOLDER, здесь будет покупка\n";
			}
			if (choose1 == 2)
			{
				std::cout << "\nДо скорых встреч!\n";
				Sleep(1000);
				break;
			}
		}

		else if (choose == 3)
		{
			std::cout << "\nДо скорых встреч!\n";
			Sleep(1000);
			break;
		}

		else
		{
			std::cout << "\n!!!НЕКОРРЕКТНЫЙ ВВОД, ВВЕДИТЕ НУЖНОЕ ЗНАЧЕНИЕ!!!\n";
			Sleep(1000);
			break;
		}
	}
	


	return 0;
}